---
kind: type
id: T:Autodesk.Revit.DB.WallKind
source: html/24ac7c1a-1dba-a5c1-fe13-e2a90e4b9488.htm
---
# Autodesk.Revit.DB.WallKind

Describes the fundamental type of wall, such as curtain wall or stacked wall.

## Syntax (C#)
```csharp
public enum WallKind
```